"cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "caskroom/versions"
tap "caskroom/fonts"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"

brew "mas"
brew "curl"
brew "docker"
brew "ffmpeg"
brew "git"
brew "imagemagick"
brew "openssl"
brew "livestreamer"
brew "mackup"
brew "node"
brew "python"
brew "python3"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "swiftlint"
brew "terminal-notifier"
brew "wget"

cask "1password"
#cask "1password-beta"
#cask "affinity-designer-beta"
#cask "affinity-photo-beta"
cask "agenda"
#cask "airmail-beta"
cask "alfred"
cask "android-studio"
#cask "android-studio-preview"
#cask "appcleaner"
cask "atom"
#cask "atom-beta"
cask "bartender"
cask "carbon-copy-cloner"
cask "charles"
#cask "charles-beta"
cask "choosy"
cask "cleanmymac"
#cask "cleanmymac3"
cask "coda"
cask "daisydisk"
cask "discord"
#cask "discord-canary"
cask "deluge"
cask "dropbox"
#cask "dropbox-beta"
cask "firefox"
#cask "firefox-beta"
#cask "firefox-developer-edition"
cask "ghost"
cask "google-chrome"
cask "google-chrome-canary"
cask "handbrake"
#cask "handbrake-nightly"
cask "hazel"
cask "imazing"
cask "imazing-mini"
cask "image2icon"
cask "imageoptim"
cask "istat-menus"
#cask "istat-menus5"
cask "iterm2"
#cask "iterm2-beta"
cask "java"
cask "nextcloud"
cask "paw"
cask "plexamp"
cask "safari-technology-preview"
cask "screens"
cask "sequel-pro"
#cask "sequel-pro-nightly"
cask "sketch"
#cask "sketch-beta"
#cask "slack-beta"
cask "soundsource"
cask "sourcetree"
#cask "sourcetree-beta"
cask "steam"
cask "transmission"
#cask "transmission-nightly"
cask "vlc"
#cask "vlc-nightly"
cask "zeplin"
cask "zoomus"# unless system "test -e /Applications/Zoom.us.app"

cask "font-roboto-mono"

mas "1Blocker", id: 1107421413
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Airmail 3", id: 918858936
mas "Apple Configurator 2", id: 1037126344
mas "Cardhop", id: 1290358394
mas "Day One", id: 1055511498
mas "Deliveries", id: 924726344
mas "Fantastical 2", id: 975937182
mas "Gemini 2", id: 1090488118
mas "Image2Icon", id: 992115977
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Paste", id: 967805235
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 880001334
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
#mas "Trello", id: 1278508951
#mas "Tweetbot", id: 1384080005
mas "Twitterrific", id: 1289378661
mas "Xcode", id: 497799835
mas "xScope", id: 889428659
